[
    {
        "codigo": -59.950352,
        "nombre": "Shanna",
        "marca": "ea",
        "categoria": "esse",
        "costo": "$2,249.10",
        "precio": "$2,265.13",
        "precio1": "$2,766.83",
        "precio2": "$1,531.47",
        "precio3": "$2,246.22",
        "stock": 0,
        "descripcion": "Nostrud incididunt sint veniam occaecat. Enim eiusmod officia laborum consectetur exercitation tempor proident quis commodo adipisicing aliqua culpa enim laboris. Quis sunt nulla nisi eu dolore pariatur aliquip commodo non in elit. Velit in nisi sint duis cupidatat amet cupidatat officia dolore voluptate. Cillum anim nisi magna labore sunt cupidatat fugiat cillum labore labore enim irure veniam Lorem.\r\n"
    },
    {
        "codigo": -44.680751,
        "nombre": "Koch",
        "marca": "sit",
        "categoria": "velit",
        "costo": "$1,736.24",
        "precio": "$3,471.09",
        "precio1": "$2,681.54",
        "precio2": "$3,942.09",
        "precio3": "$1,232.44",
        "stock": 1,
        "descripcion": "Consectetur ut sint anim ullamco. Ea quis enim ex exercitation ex enim. Proident veniam aute reprehenderit mollit. Deserunt eiusmod dolore adipisicing magna sint deserunt adipisicing exercitation ea consectetur dolor ea. Eiusmod id aliqua quis laboris sint culpa officia commodo ut aliqua cupidatat quis nulla. Sunt cupidatat nostrud exercitation amet sunt velit aute reprehenderit id cillum. Sit aliqua occaecat officia in elit incididunt amet labore minim fugiat.\r\n"
    },
    {
        "codigo": 46.352479,
        "nombre": "Glenda",
        "marca": "do",
        "categoria": "deserunt",
        "costo": "$3,263.92",
        "precio": "$2,931.01",
        "precio1": "$3,324.09",
        "precio2": "$3,088.06",
        "precio3": "$2,911.21",
        "stock": 2,
        "descripcion": "Mollit aliquip cupidatat consectetur Lorem aliquip occaecat in qui exercitation nulla. Aute aliqua et tempor elit ullamco est id ipsum tempor. Ex qui et id do occaecat eu.\r\n"
    },
    {
        "codigo": -27.223714,
        "nombre": "Armstrong",
        "marca": "ex",
        "categoria": "eu",
        "costo": "$3,734.38",
        "precio": "$3,668.83",
        "precio1": "$3,235.97",
        "precio2": "$3,248.17",
        "precio3": "$3,053.63",
        "stock": 3,
        "descripcion": "In sint cillum aute tempor eu aliquip adipisicing minim eu. Ex eiusmod fugiat qui aliquip. Cupidatat eiusmod anim pariatur do laborum. Pariatur ipsum nostrud consectetur deserunt cupidatat mollit anim fugiat laborum eu minim consequat do nisi. Cillum reprehenderit sunt est elit ad sint duis laborum ut laboris exercitation ut. Tempor aliquip mollit id fugiat occaecat cupidatat. Aute consectetur ullamco labore duis est Lorem non fugiat anim voluptate.\r\n"
    },
    {
        "codigo": 75.358143,
        "nombre": "Leanne",
        "marca": "anim",
        "categoria": "quis",
        "costo": "$1,427.37",
        "precio": "$1,029.66",
        "precio1": "$1,091.30",
        "precio2": "$1,161.49",
        "precio3": "$2,775.87",
        "stock": 4,
        "descripcion": "Eu irure occaecat laboris eu. Occaecat eiusmod culpa non irure aliquip mollit commodo sit in esse fugiat nulla. Officia voluptate Lorem quis irure irure officia aute mollit id aliqua. Laboris eiusmod nulla ad dolore eiusmod cupidatat duis. Amet excepteur cupidatat officia est quis elit dolor mollit eu irure dolore.\r\n"
    },
    {
        "codigo": -6.70806,
        "nombre": "Thompson",
        "marca": "dolor",
        "categoria": "excepteur",
        "costo": "$2,189.75",
        "precio": "$1,816.80",
        "precio1": "$2,043.35",
        "precio2": "$3,793.31",
        "precio3": "$1,770.30",
        "stock": 5,
        "descripcion": "Dolore duis officia minim officia amet excepteur do sint. Veniam ut magna reprehenderit cupidatat excepteur est veniam voluptate qui. Commodo irure ad dolor id aliquip duis dolore. Nulla exercitation ea laboris aute eiusmod do dolore. Culpa consectetur quis occaecat do tempor laborum nostrud reprehenderit.\r\n"
    },
    {
        "codigo": 6.040718,
        "nombre": "Wheeler",
        "marca": "irure",
        "categoria": "labore",
        "costo": "$3,795.21",
        "precio": "$3,703.12",
        "precio1": "$1,030.07",
        "precio2": "$2,387.22",
        "precio3": "$3,526.76",
        "stock": 6,
        "descripcion": "Do fugiat dolor fugiat est nisi minim deserunt ea duis culpa. Veniam proident nulla nisi dolor eiusmod dolor. Incididunt laborum et aliqua veniam Lorem ea et commodo ex sunt est mollit. Tempor et velit laborum mollit ex anim elit incididunt ullamco magna labore ullamco exercitation laboris. Mollit duis fugiat officia aliquip excepteur.\r\n"
    },
    {
        "codigo": 54.211472,
        "nombre": "Owens",
        "marca": "ad",
        "categoria": "adipisicing",
        "costo": "$2,462.85",
        "precio": "$3,676.41",
        "precio1": "$1,221.92",
        "precio2": "$1,348.69",
        "precio3": "$1,694.09",
        "stock": 7,
        "descripcion": "Lorem aliquip aute laborum proident esse laboris commodo commodo quis nostrud eu eiusmod aliqua adipisicing. Irure nulla aliqua in culpa. Sint aliquip nostrud eiusmod cillum anim. Commodo officia non est aliqua elit eiusmod culpa consectetur enim.\r\n"
    },
    {
        "codigo": 88.018203,
        "nombre": "Daniel",
        "marca": "nulla",
        "categoria": "qui",
        "costo": "$1,528.72",
        "precio": "$3,712.75",
        "precio1": "$3,999.72",
        "precio2": "$3,936.73",
        "precio3": "$3,594.58",
        "stock": 8,
        "descripcion": "Consequat nisi commodo minim id. Cillum nisi nostrud officia incididunt amet reprehenderit duis. Esse sit tempor pariatur ad amet velit et esse dolore nostrud ullamco. Exercitation enim ea pariatur eiusmod laborum incididunt ipsum mollit cillum.\r\n"
    },
    {
        "codigo": -37.110294,
        "nombre": "Tracey",
        "marca": "Lorem",
        "categoria": "sunt",
        "costo": "$1,651.24",
        "precio": "$1,754.45",
        "precio1": "$2,867.61",
        "precio2": "$3,113.35",
        "precio3": "$2,943.10",
        "stock": 9,
        "descripcion": "Ea est cillum pariatur ea. Laboris in labore aliqua ex dolor occaecat pariatur laboris magna adipisicing quis quis. Nostrud est deserunt non ipsum nostrud incididunt ut sint dolore sunt sunt culpa. Cillum tempor qui non nostrud eiusmod proident voluptate. Irure nostrud aliqua labore exercitation aliquip commodo commodo do.\r\n"
    },
    {
        "codigo": -73.342281,
        "nombre": "Earnestine",
        "marca": "veniam",
        "categoria": "deserunt",
        "costo": "$3,058.57",
        "precio": "$3,446.03",
        "precio1": "$1,948.86",
        "precio2": "$1,387.83",
        "precio3": "$3,819.33",
        "stock": 10,
        "descripcion": "Pariatur id voluptate reprehenderit laboris. Incididunt ex ad culpa pariatur sint elit qui officia irure commodo nisi sunt. Sit consectetur ad nulla incididunt pariatur cillum non ipsum culpa ad minim ut.\r\n"
    },
    {
        "codigo": 25.388909,
        "nombre": "Kasey",
        "marca": "tempor",
        "categoria": "ad",
        "costo": "$3,834.09",
        "precio": "$3,581.89",
        "precio1": "$3,683.05",
        "precio2": "$1,420.74",
        "precio3": "$3,785.50",
        "stock": 11,
        "descripcion": "Ullamco ea minim ea aliqua cupidatat ex proident elit. Incididunt cupidatat fugiat commodo culpa anim ullamco nostrud reprehenderit velit magna cupidatat. Qui et ea nisi esse exercitation ullamco.\r\n"
    },
    {
        "codigo": -39.931788,
        "nombre": "Marlene",
        "marca": "eiusmod",
        "categoria": "culpa",
        "costo": "$1,950.44",
        "precio": "$3,748.90",
        "precio1": "$3,416.44",
        "precio2": "$1,851.84",
        "precio3": "$3,820.16",
        "stock": 12,
        "descripcion": "Exercitation ea elit officia labore non dolor fugiat qui nulla culpa officia exercitation. Exercitation reprehenderit commodo aute irure ipsum dolor est aliqua non nulla culpa culpa est ut. Anim ad exercitation culpa deserunt adipisicing mollit enim sit mollit dolor est. Culpa duis veniam anim nisi id consequat quis in ad aliqua Lorem commodo.\r\n"
    }
]